
// Возвращает случайного противоника из справочника.
// 
// Параметры:
// 	ГСЧ - ГенераторСлучайныхЧисел - переменная для генерации случайных чисел.
//
// Возвращаемое значение:
// 	СправочникСсылка.Противники - ссылка на случайного противоника.
//
Функция ПолучитьСлучайногоПротивника(ГСЧ) Экспорт
	РезультатФункции = Справочники.Противники.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	Противники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Противники КАК Противники
		|ГДЕ
		|	Противники.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Противники.Код УБЫВ";
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	Если Выгрузка.Количество() > 0 Тогда
		Индекс = ГСЧ.СлучайноеЧисло(0, Выгрузка.Количество() - 1);
		РезультатФункции = Выгрузка[Индекс].Ссылка;
	Иначе
		РезультатФункции = Справочники.Противники.ПустаяСсылка();
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ПолучитьСлучайногоПротивника()