
// Возвращает случайный модификатор, который имеет признак положительности ПоложительныйВход.
//
// Параметры:
//  ПоложительныйВход - Булево - признак, что модификатор должен быть положительным.
//  Гсч   - ГенераторСлучайныхЧисел - генератор случайных чисел.
//  ИсключаемыеМодификаторыВход - Массив - массив ссылок на модификаторы, которые нужно исключить.
// 
// Возвращаемое значение:
//   - СправочникСсылка.Модификаторы - случайный модификатор.
//
Функция ВернутьМодификатор(ПоложительныйВход, Гсч, ИсключаемыеМодификаторыВход = Неопределено) Экспорт
	ПустойМодификатор = Справочники.Модификаторы.ПустаяСсылка();
	РезультатФункции = ПустойМодификатор;
	// Получим случайный модификатор, не помеченный на удаление, ориентируясь на признак положительного.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Модификаторы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Модификаторы КАК Модификаторы
	|ГДЕ
	|	НЕ Модификаторы.ПометкаУдаления
	|	И Модификаторы.Положительный = &ПоложительныйВход
	|	И НЕ Модификаторы.Ссылка В (&ИсключаемыеМодификаторы)";
	Запрос.УстановитьПараметр("ПоложительныйВход", ПоложительныйВход);
	Если ИсключаемыеМодификаторыВход <> Неопределено И ТипЗнч(ИсключаемыеМодификаторыВход) = Тип("Массив") Тогда
		Запрос.УстановитьПараметр("ИсключаемыеМодификаторы", ИсключаемыеМодификаторыВход);
	Иначе
		Запрос.УстановитьПараметр("ИсключаемыеМодификаторы", Новый Массив);
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		КоличествоВыборки = РезультатЗапроса.Выбрать().Количество();
		СлучайноеЧисло = Гсч.СлучайноеЧисло(0, КоличествоВыборки - 1);
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Счетчик = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			РезультатФункции = ВыборкаДетальныеЗаписи.Ссылка;
			Счетчик = Счетчик + 1;
			Если Счетчик = СлучайноеЧисло Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		// Не удалось получить модификатор. Вернём пустой.
		РезультатФункции = ПустойМодификатор;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции
