
// Возвращает случайный модификатор, который имеет признак положительности ПоложительныйВход.
//
// Параметры:
//  ПоложительныйВход - Булево - признак, что модификатор должен быть положительным.
//  Гсч				 - ГенераторСлучайныхЧисел - генератор случайных чисел.
// 
// Возвращаемое значение:
//   - СправочникСсылка.Модификаторы - случайный модификатор.
//
Функция ВернутьМодификатор(ПоложительныйВход, Гсч) Экспорт
	ПустойМодификатор = Справочники.Модификаторы.ПустаяСсылка();
	РезультатФункции = ПустойМодификатор;
	// Получим случайный модификатор, не помеченный на удаление, ориентируясь на признак положительного.
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	Модификаторы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Модификаторы КАК Модификаторы
		|ГДЕ
		|	НЕ Модификаторы.ПометкаУдаления
		|	И Модификаторы.Положительный = &ПоложительныйВход";
	Запрос.УстановитьПараметр("ПоложительныйВход", ПоложительныйВход);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		КоличествоВыборки = РезультатЗапроса.Выбрать().Количество();
		СлучайноеЧисло = Гсч.СлучайноеЧисло(0, КоличествоВыборки - 1);
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Счетчик = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			РезультатФункции = ВыборкаДетальныеЗаписи.Ссылка;
			Счетчик = Счетчик + 1;
			Если Счетчик = СлучайноеЧисло Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		// Не удалось получить модификатор. Вернём пустой.
		РезультатФункции = ПустойМодификатор;
	КонецЕсли;
	Возврат РезультатФункции;	
КонецФункции