&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Инициализация.
	МассивПараметровИгрока = Параметры.ПараметрыИгрока;
	МассивПараметровПротивника = Параметры.ПараметрыПротивника;
	МассивМодификаторов = Параметры.Модификаторы;
	МассивКартКолоды = Параметры.КартыКолоды;
	ВсегоЭтапов = Параметры.ВсегоЭтапов;
	НомерЭтапа = Параметры.НомерЭтапа;
	// Заполнение таблицы эффектов игрока из массива структур.
	ЭффектыИгрокаТЗ.Очистить();
	Для Каждого ТекЭлементПараметрыИгрока Из МассивПараметровИгрока Цикл
		НоваяСтрока = ЭффектыИгрокаТЗ.Добавить();
		НоваяСтрока.ВидПараметра = ТекЭлементПараметрыИгрока.ВидПараметра;
		НоваяСтрока.ЗначениеПараметра = ТекЭлементПараметрыИгрока.ЗначениеПараметра;
	КонецЦикла;
	// Заполнение таблицы эффектов противника из массива структур.
	ЭффектыПротивникаТЗ.Очистить();
	Для Каждого ТекЭлементПараметрыПротивника Из МассивПараметровПротивника Цикл
		НоваяСтрока = ЭффектыПротивникаТЗ.Добавить();
		НоваяСтрока.ВидПараметра = ТекЭлементПараметрыПротивника.ВидПараметра;
		НоваяСтрока.ЗначениеПараметра = ТекЭлементПараметрыПротивника.ЗначениеПараметра;
	КонецЦикла;
	// Заполнение таблицы модификаторов из массива структур.
	МодификаторыТЗ.Очистить();
	Для Каждого ТекЭлементМодификаторы Из МассивМодификаторов Цикл
		НоваяСтрока = МодификаторыТЗ.Добавить();
		НоваяСтрока.Модификатор = ТекЭлементМодификаторы.Модификатор;
	КонецЦикла;
	// Заполнение таблицы карт из массива структур.
	КартыТЗ.Очистить();
	Для Каждого ТекЭлементКартыКолоды Из МассивКартКолоды Цикл
		НоваяСтрока = КартыТЗ.Добавить();
		НоваяСтрока.Карта = ТекЭлементКартыКолоды.Карта;
	КонецЦикла;
	// Заполнение таблицы журнала боя из массива структур.
	ЖурналБоя.Очистить();
	МассивЖурналаБоя = Параметры.ЖурналБоя;
	Для Каждого ТекЭлементЖурналБоя Из МассивЖурналаБоя Цикл
		НоваяСтрока = ЖурналБоя.Добавить();
		НоваяСтрока.СобытиеБоя = ТекЭлементЖурналБоя.СобытиеБоя;
		НоваяСтрока.СвязанныйОбъект = ТекЭлементЖурналБоя.СвязанныйОбъект;
		НоваяСтрока.Количество = ТекЭлементЖурналБоя.Количество;
		НоваяСтрока.Период = ТекЭлементЖурналБоя.Период;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура МодификаторыТЗПриВыбореСтроки(Элемент)
	ТекДанныеМодификаторы = Элементы.МодификаторыТЗ.ТекущиеДанные;
	Если ТекДанныеМодификаторы = Неопределено Тогда
		ТекстОписания = "";
	Иначе
		ТекстОписания = ТекДанныеМодификаторы.Модификатор.Описание;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КартыТЗПриВыбореСтроки(Элемент)
	ТекДанныеКарты = Элементы.КартыТЗ.ТекущиеДанные;
	Если ТекДанныеКарты = Неопределено Тогда
		ТекстОписания = "";
	Иначе
		ТекстОписания = ТекДанныеКарты.Карта.Описание;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры
