&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Инициализация.
	МассивПараметровИгрока = Параметры.ПараметрыИгрока;
	МассивПараметровПротивника = Параметры.ПараметрыПротивника;
	МассивМодификаторов = Параметры.Модификаторы;
	МассивКартКолоды = Параметры.КартыКолоды;
	// Заполнение таблицы эффектов игрока из массива структур.
	Для Каждого ТекЭлементПараметрыИгрока Из МассивПараметровИгрока Цикл
		НоваяСтрока = ЭффектыИгрокаТЗ.Добавить();
		НоваяСтрока.ВидПараметра = ТекЭлементПараметрыИгрока.ВидПараметра;
		НоваяСтрока.ЗначениеПараметра = ТекЭлементПараметрыИгрока.ЗначениеПараметра;
	КонецЦикла;
	// Заполнение таблицы эффектов противника из массива структур.
	Для Каждого ТекЭлементПараметрыПротивника Из МассивПараметровПротивника Цикл
		НоваяСтрока = ЭффектыПротивникаТЗ.Добавить();
		НоваяСтрока.ВидПараметра = ТекЭлементПараметрыПротивника.ВидПараметра;
		НоваяСтрока.ЗначениеПараметра = ТекЭлементПараметрыПротивника.ЗначениеПараметра;
	КонецЦикла;
	// Заполнение таблицы модификаторов из массива структур.
	Для Каждого ТекЭлементМодификаторы Из МассивМодификаторов Цикл
		НоваяСтрока = МодификаторыТЗ.Добавить();
		НоваяСтрока.Модификатор = ТекЭлементМодификаторы.Модификатор;
	КонецЦикла;
	// Заполнение таблицы карт из массива структур.
	Для Каждого ТекЭлементКартыКолоды Из МассивКартКолоды Цикл
		НоваяСтрока = КартыТЗ.Добавить();
		НоваяСтрока.Карта = ТекЭлементКартыКолоды.Карта;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура МодификаторыТЗПриВыбореСтроки(Элемент)
	ТекДанныеМодификаторы = Элементы.МодификаторыТЗ.ТекущиеДанные;
	Если ТекДанныеМодификаторы = Неопределено Тогда
		ТекстОписания = "";
	Иначе
		ТекстОписания = ТекДанныеМодификаторы.Модификатор.Описание;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КартыТЗПриВыбореСтроки(Элемент)
	ТекДанныеКарты = Элементы.КартыТЗ.ТекущиеДанные;
	Если ТекДанныеКарты = Неопределено Тогда
		ТекстОписания = "";
	Иначе
		ТекстОписания = ТекДанныеКарты.Карта.Описание;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры
