&НаСервере
Перем Гсч;		// Генератор случайных чисел.

&НаКлиенте
Процедура ВыбратьЭтап(Команда)
	// Получаем выбранную строку из таблицы этапов
	ТекДанные = Элементы.ТаблицаЭтапов.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		// Возвращаем результат через структуру
		Результат = Новый Структура;
		Результат.Вставить("ВидЭтапа",	 ТекДанные.ВидЭтапа);
		Результат.Вставить("Противник",	 ТекДанные.Противник);
		Результат.Вставить("НомерЭтапа", НомерЭтапа + 1);
		// Записываем результат и закрываем форму
		Модифицированность = Ложь;
		Закрыть(Результат);
	Иначе
		Предупреждение("Выберите этап из списка.");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Инициализация генератора случайных чисел
	Гсч = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	// Считываем параметры формы.
	ВсегоЭтапов = Параметры.ВсегоЭтапов;
	НомерЭтапа = Параметры.НомерЭтапа;
	// Считываем предыдущие значения противника и вида этапа
	Если Параметры.Свойство("ПредыдущийПротивник") Тогда
		ПредыдущийПротивник = Параметры.ПредыдущийПротивник;
	КонецЕсли;
	Если Параметры.Свойство("ПредыдущийВидЭтапа") Тогда
		ПредыдущийВидЭтапа = Параметры.ПредыдущийВидЭтапа;
		Если ПредыдущийВидЭтапа <> Перечисления.ВидыЭтаповВосхождения.Противник Тогда
			ПредыдущийПротивник = Справочники.Противники.ПустаяСсылка();
		Иначе
			// Не очищаем противника.
		КонецЕсли;	
	КонецЕсли;
	// Формирование заголовка декорации.
	Элементы.ДекорацияНомерЭтапа.Заголовок = Строка(НомерЭтапа) + "/" + Строка(ВсегоЭтапов);
	// Заполнение таблицы этапов
	ЗаполнитьТаблицуЭтапов();
КонецПроцедуры

// Осуществляет заполнение таблицы этапов.
//
&НаСервере
Процедура ЗаполнитьТаблицуЭтапов()
	// Инициализация.
	ЧислоЭтаповДляВыбора = 3;
	МаксимальныйНомерЭтапаВратаСпешки = 23;
	// Инициализация таблицы этапов
	ТаблицаЭтапов.Очистить();
	// Заполняем таблицу этапов строками с распределением вероятностей
	Для Индекс = 1 По ЧислоЭтаповДляВыбора Цикл
		ЭтоЭлитнаяСложность = Обработки.ТестированиеЗнаний.ЭтоЭтапЭлитнойСложности(НомерЭтапа);
		НоваяСтрока = ТаблицаЭтапов.Добавить();
		Если ЭтоЭлитнаяСложность Тогда
			ВидЭтапа = Перечисления.ВидыЭтаповВосхождения.Противник;
		Иначе
		// Генерируем случайное число от 0 до 99 для определения вероятности
		СлучайноеЗначение = Гсч.СлучайноеЧисло(0, 99);
			// Распределение вероятностей:
			// 0-82 (82%) - Противник
			// 83-88 (5%) - Торговец
			// 89-91 (2%) - Врата спешки
			// 92-96 (4%) - Отдых
			// 97-99 (3%) - Сокровище
			Если СлучайноеЗначение < 83 Тогда
				ВидЭтапа = Перечисления.ВидыЭтаповВосхождения.Противник;
			ИначеЕсли СлучайноеЗначение < 89 Тогда
				ВидЭтапа = Перечисления.ВидыЭтаповВосхождения.Торговец;
			ИначеЕсли СлучайноеЗначение < 92 Тогда
				ВидЭтапа = Перечисления.ВидыЭтаповВосхождения.ВратаСпешки;				
			ИначеЕсли СлучайноеЗначение < 97 Тогда
				ВидЭтапа = Перечисления.ВидыЭтаповВосхождения.Отдых;
			Иначе
				ВидЭтапа = Перечисления.ВидыЭтаповВосхождения.Сокровище;
			КонецЕсли;
		КонецЕсли;
		// Запрет этапа Врата спешки для этапа больше максимального.
		ЭтоВратаСпешки = (ВидЭтапа = Перечисления.ВидыЭтаповВосхождения.ВратаСпешки);
		МаксимальныйНомерПревышен = НомерЭтапа > МаксимальныйНомерЭтапаВратаСпешки;
		Если (МаксимальныйНомерПревышен) И (ЭтоВратаСпешки) Тогда
			ВидЭтапа = Перечисления.ВидыЭтаповВосхождения.Противник;
		Иначе
			// Разрешае в остальных случаях.
		КонецЕсли;
		НоваяСтрока.ВидЭтапа = ВидЭтапа;
		// Если выбран вид этапа "Противник", заполняем поле Противник
		Если НоваяСтрока.ВидЭтапа = Перечисления.ВидыЭтаповВосхождения.Противник Тогда
			Если НомерЭтапа <= 5 Тогда
				СложностьДляПротивника = Перечисления.СложностиПротивников.Начальная;
			Иначе
				Если ЭтоЭлитнаяСложность Тогда
					СложностьДляПротивника = Перечисления.СложностиПротивников.Элитная;
				Иначе
					СложностьДляПротивника = Перечисления.СложностиПротивников.Обычная;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрока.Противник = Справочники.Противники.ПолучитьСлучайногоПротивника(Гсч, СложностьДляПротивника);
		Иначе
			НоваяСтрока.Противник = Справочники.Противники.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Размещает описание выбранного этапа на форме.
//
// Параметры:
//	ВидЭтапаВход - ПеречисленияСсылка.ВидыЭтаповВосхождения - Вид этапа, описание которого готовится.
//
&НаКлиенте
Процедура ЗагрузитьОписаниеЭтапа(ВидЭтапаВход)
	Если ВидЭтапаВход = ПредопределенноеЗначение("Перечисление.ВидыЭтаповВосхождения.Противник") Тогда
		Описание = "Битва с выбранным противником";
	ИначеЕсли ВидЭтапаВход = ПредопределенноеЗначение("Перечисление.ВидыЭтаповВосхождения.ВратаСпешки") Тогда
		Описание = "Пропустить 4 следующих этапа";
	ИначеЕсли ВидЭтапаВход = ПредопределенноеЗначение("Перечисление.ВидыЭтаповВосхождения.Отдых") Тогда
		Описание = "Восстановить 30% здоровья";
	ИначеЕсли ВидЭтапаВход = ПредопределенноеЗначение("Перечисление.ВидыЭтаповВосхождения.Сокровище") Тогда
		Описание = "Получить случаный модификатор";
	ИначеЕсли ВидЭтапаВход = ПредопределенноеЗначение("Перечисление.ВидыЭтаповВосхождения.Торговец") Тогда	
		Описание = "Торговать за золото";
	Иначе
		Описание = "";
	КонецЕсли;
КонецПроцедуры		// ЗагрузитьОписаниеЭтапа()

&НаКлиенте
Процедура ТаблицаЭтаповПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ТаблицаЭтапов.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекВидЭтапа = ТекДанные.ВидЭтапа;
		ЭтоЭтапПротивник = (ТекВидЭтапа = ПредопределенноеЗначение("Перечисление.ВидыЭтаповВосхождения.Противник"));
		Элементы.ТаблицаЭтаповПротивникОписание.Видимость = ЭтоЭтапПротивник;
		ЗагрузитьОписаниеЭтапа(ТекВидЭтапа);
	Иначе
		// Строка не выбрана. Ничего не делаем.
	КонецЕсли;
КонецПроцедуры
