

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Проверка существования одного правильного ответа.
	КоличествоПравильных = 0;
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Правильность", Истина);
	НайденныеСтроки = ОтветыЗаданий.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Сообщить("Не найдено вариантов правильных ответов.");
		Отказ = Истина;
	ИначеЕсли НайденныеСтроки.Количество() = 1 Тогда
		// Проверка пройдена успешно.
	Иначе
		Сообщить("Найдено больше одного варианта правильных ответов.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

