
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Получение параметров.
	ПолученноеЗолото = Параметры.ПолученноеЗолото;
	Противник = Параметры.Противник;
	ПредлагаемыеКарты.Очистить();
	Для Каждого ТекПредлагаемыеКарты Из Параметры.ПредлагаемыеКарты Цикл
		НоваяСтрока = ПредлагаемыеКарты.Добавить();
		НоваяСтрока.Карта = ТекПредлагаемыеКарты.Значение;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗабратьНаграды(Команда)
	ТекДанные = Элементы.ПредлагаемыеКарты.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Золото",	 ПолученноеЗолото);
		СтруктураПараметров.Вставить("Карта",	 ТекДанные.Карта);
		Закрыть(СтруктураПараметров);
	Иначе
		Сообщить("Требуется выбрать награду");
	КонецЕсли;
КонецПроцедуры
