
&НаКлиенте
Перем ПодтвержденоЗакрытиеФормы;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Получение параметров.
	ПолученноеЗолото = Параметры.ПолученноеЗолото;
	Противник = Параметры.Противник;
	ТекущееЗолото = Параметры.ТекущееЗолото;
	ПредлагаемыеКарты.Очистить();
	Для Каждого ТекПредлагаемыеКарты Из Параметры.ПредлагаемыеКарты Цикл
		НоваяСтрока = ПредлагаемыеКарты.Добавить();
		НоваяСтрока.Карта = ТекПредлагаемыеКарты.Значение;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗабратьНаграды(Команда)
	ТекДанные = Элементы.ПредлагаемыеКарты.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Золото",	 ПолученноеЗолото);
		СтруктураПараметров.Вставить("Карта",	 ТекДанные.Карта);
		ПодтвержденоЗакрытиеФормы = Истина;
		Закрыть(СтруктураПараметров);
	Иначе
		Сообщить("Требуется выбрать награду");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПропуститьНаграды(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Золото", ПолученноеЗолото + 15);
	ПодтвержденоЗакрытиеФормы = Истина;
	Закрыть(СтруктураПараметров);
КонецПроцедуры

// Блокирует закрытие формы, пока не выбрано действие с наградой.
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЗавершениеРаботы И Не ПодтвержденоЗакрытиеФормы Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

ПодтвержденоЗакрытиеФормы = Ложь;
