// Открывает форму головоломки "Меморикс".
//
&НаКлиенте
Процедура ЗапуститьМеморикс(Команда)
	ОткрытьФорму("Обработка.ТестированиеЗнаний.Форма.ФормаМеморикс", , ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

// Открывает форму головоломки "Пятнашки".
//
&НаКлиенте
Процедура ЗапуститьПятнашки(Команда)
	ОткрытьФорму("Обработка.ТестированиеЗнаний.Форма.ФормаПятнашки", , ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

// Открывает форму головоломки "Таблица Шульте".
//
&НаКлиенте
Процедура ЗапуститьТаблицаШульте(Команда)
	ОткрытьФорму("Обработка.ТестированиеЗнаний.Форма.ФормаТаблицаШульте", , ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьWordle(Команда)
	ОткрытьФорму("Обработка.ТестированиеЗнаний.Форма.ФормаWordle", , ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьВиселица(Команда)
	ОткрытьФорму("Обработка.ТестированиеЗнаний.Форма.ФормаВиселица", , ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
