
// Определяет, все ли элементы в массиве МассивОтветовВход уникальны.
Функция ОпределитьПовторяющиесяОтветы(МассивОтветовВход) Экспорт
	РезультатФункции = Истина;
	Свертка = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивОтветовВход);
	РазмерностиСовпадают = (Свертка.Количество() = МассивОтветовВход.Количество());
	РезультатФункции = (НЕ РазмерностиСовпадают);
	Возврат РезультатФункции;
КонецФункции		// ОпределитьПовторяющиесяОтветы()

// Возвращает случайное задание, принадлежающее сборнику СборникВход.
Функция НайтиСлучайноеЗадание(СборникВход, Гсч) Экспорт
	РезультатФункции = Справочники.Задания.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Задания.Ссылка,
		|	Задания.Владелец
		|ИЗ
		|	Справочник.Задания КАК Задания
		|ГДЕ
		|	Задания.Владелец = &Владелец
		|	И НЕ Задания.ПометкаУдаления";
	Запрос.УстановитьПараметр("Владелец", СборникВход);
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	МассивЗаданий = Выгрузка.ВыгрузитьКолонку("Ссылка");
	КоличествоЗаданий = МассивЗаданий.Количество();
	Если КоличествоЗаданий > 0 Тогда
		ИндексЗадания = гсч.СлучайноеЧисло(0, КоличествоЗаданий - 1);
		РезультатФункции = МассивЗаданий[ИндексЗадания];
	Иначе
		ТекстСообщения = "Не найдено ни одного задания для сборника %Сборник%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Сборник%", Строка(СборникВход));
		Сообщить(ТекстСообщения);
		РезультатФункции = Справочники.Задания.ПустаяСсылка();
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции

// Возвращает случайный сборник из доступных.
Функция ПолучитьСлучайныйСборник(ВыбранныеСборникиВход, ГСЧ) Экспорт
	РезультатФункции = Справочники.Сборники.ПустаяСсылка();
	Запрос = Новый Запрос;
	Если ВыбранныеСборникиВход.Количество() > 0 Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сборники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сборники КАК Сборники
		|ГДЕ
		|	НЕ Сборники.ПометкаУдаления
		|	И Сборники.Ссылка В(&Ссылка)";
		Запрос.УстановитьПараметр("Ссылка", ВыбранныеСборникиВход);
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сборники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сборники КАК Сборники
		|ГДЕ
		|	НЕ Сборники.ПометкаУдаления";
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	МассивСборников = Выгрузка.ВыгрузитьКолонку("Ссылка");
	МассивСборников = ОбщегоНазначенияКлиентСервер.СмешатьМассив(МассивСборников, Гсч);
	Если МассивСборников.Количество() > 0 Тогда
		РезультатФункции = МассивСборников[0];
	Иначе
		РезультатФункции = Справочники.Сборники.ПустаяСсылка();
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ПолучитьСлучайныйСборник()

// Добавляет в регистр РезультатыТестированияЗнаний запись об отвеченном задании
// в сборнике СборникВход по пользователю ПользовательВход. Когда ВерноВход
// Истина, будет записан результат верного ответа, иначе - неверного.
Процедура ЗаписатьОтветВРезультаты(СборникВход, ПользовательВход, ВерноВход) Экспорт
	МенеджерЗаписи = РегистрыСведений.РезультатыТестированияЗнаний.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период				 = ТекущаяДата();
	МенеджерЗаписи.Сборник				 = СборникВход;
	МенеджерЗаписи.Пользователь			 = ПользовательВход;
	МенеджерЗаписи.ЗаданоВопросов		 = 1;
	Если ВерноВход Тогда
		МенеджерЗаписи.ОтвеченоВерно	 = 1;
	Иначе
		МенеджерЗаписи.ОтвеченоВерно	 = 0;
	КонецЕсли;
	МенеджерЗаписи.Записать();
КонецПроцедуры

// Возвращает массив номеров неправильных ответов для количества 
// ответов КоличествоОтветовВход, игнорируя правильный ответ
// НомерПравильногоОтветаВход.
Функция ПолучитьМассивОтветовКУдалениюПоКоличеству(НомерПравильногоОтветаВход, ГСЧ, КоличествоОтветовВход) Экспорт
	РезультатФункции = Новый Массив;
	Счетчик = 1;
	НоваяГраница = Цел(КоличествоОтветовВход / 2) + 1;
	Пока Счетчик < НоваяГраница Цикл
		Найдено = Ложь;
		Пока НЕ Найдено Цикл
			НомерНеправильногоОтвета = ГСЧ.СлучайноеЧисло(1, КоличествоОтветовВход);
			Добавлен = (РезультатФункции.Найти(НомерНеправильногоОтвета) <> Неопределено);
			СовпадаетСПравильным = (НомерНеправильногоОтвета = НомерПравильногоОтветаВход);
			Если (НЕ Добавлен) И (НЕ СовпадаетСПравильным) Тогда
				Найдено = Истина;
				РезультатФункции.Добавить(НомерНеправильногоОтвета);
			Иначе
				Найдено = Ложь;
			КонецЕсли;
		КонецЦикла;	
		Счетчик = Счетчик + 1;
	КонецЦикла;	
	Возврат РезультатФункции;
КонецФункции		// ПолучитьМассивОтветовКУдалениюПоКоличеству()	

// Возвращает номера этапов для элитной сложности.
//
// Возвращаемое значение:
//	Массив - Массив номеров этапов эличной сложности.
//
Функция МассивЭтаповЭлитныхПротивников() Экспорт
	РезультатФункции = Новый Массив;
	РезультатФункции.Добавить(10);
	РезультатФункции.Добавить(20);
	РезультатФункции.Добавить(30);
	Возврат РезультатФункции;
КонецФункции		 // МассивЭтаповЭлитныхПротивников()

// Определяет, является ли этап этапом элитной сложности.
//
// Параметры:
//	НомерЭтапаВход - Число - номер этапа, который нужно проверить.
//
// Возвращаемое значение:
//	Булево - Истина, если этап является этапом элитной сложности.
//
Функция ЭтоЭтапЭлитнойСложности(НомерЭтапаВход) Экспорт
	РезультатФункции = Ложь;
	ЭтапыЭличнойСложности = Обработки.ТестированиеЗнаний.МассивЭтаповЭлитныхПротивников();
	РезультатФункции = (ЭтапыЭличнойСложности.Найти(НомерЭтапаВход) <> Неопределено);
	Возврат РезультатФункции;	
КонецФункции		 // ЭтоЭтапЭлитнойСложности()
