// Сохраняет данные восхождения пользователя.
//
// Параметры:
//  ДанныеВосхождения - Структура - данные для сохранения:
//   - Пользователь - СправочникСсылка.Пользователи - пользователь
//   - ПараметрыИгрока - Таблица - параметры игрока
//   - КолодаИгрока - Таблица - колода игрока
//   - Модификаторы - Таблица - модификаторы
//   - НомерЭтапа - Число - номер этапа
//  ПользовательВход - СправочникСсылка.Пользователи - (необязательно) пользователь для сохранения
Процедура СохранитьВосхождениеПользователя(ДанныеВосхождения, ПользовательВход = Неопределено) Экспорт
	
	Если ПользовательВход = Неопределено Тогда
		Запись = РегистрыСведений.СохраненияВосхождения.СоздатьЗапись();
		Запись.Пользователь = ДанныеВосхождения.Пользователь;
	Иначе
		Запись = РегистрыСведений.СохраненияВосхождения.СоздатьЗапись();
		Запись.Пользователь = ПользовательВход;
	КонецЕсли;
	
	Запись.ХранилищеСохранения = Новый ХранилищеЗначения(ДанныеВосхождения);
	Запись.Записать();
	
КонецПроцедуры
