// Сохраняет данные восхождения пользователя.
//
// Параметры:
//  ДанныеВосхождения - Структура - данные для сохранения:
//   - Пользователь - СправочникСсылка.Пользователи - пользователь
//   - ПараметрыИгрока - Таблица - параметры игрока
//   - КолодаИгрока - Таблица - колода игрока
//   - Модификаторы - Таблица - модификаторы
//   - НомерЭтапа - Число - номер этапа
//  ПользовательВход - СправочникСсылка.Пользователи - (необязательно) пользователь для сохранения
Процедура СохранитьВосхождениеПользователя(ДанныеВосхождения, ПользовательВход = Неопределено) Экспорт
	Попытка
		ТекПользователь = ОбщегоНазначенияВызовСервера.ТекущийПользователь();
		ПользовательРабочий = ТекПользователь;
		Если ЗначениеЗаполнено(ПользовательВход) Тогда
			ПользовательРабочий = ПользовательВход;
		Иначе
			ПользовательРабочий = ТекПользователь;
		КонецЕсли;
		Запись = РегистрыСведений.СохраненияВосхождения.СоздатьМенеджерЗаписи();
		Запись.Пользователь = ПользовательРабочий;
		Запись.ХранилищеСохранения = Новый ХранилищеЗначения(ДанныеВосхождения);
		Запись.Записать();
	Исключение
		Сообщить("Не удалось сохранить восхождение пользователя " + Строка(ПользовательРабочий));
	КонецПопытки;
КонецПроцедуры
