Перем Гсч;		//Генератор случайных чисел.

// Возвращает случайный доступный сборник.
&НаСервере
Функция ВернутьСлучайныйСборник()
	РезультатФункции = Справочники.Сборники.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сборники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сборники КАК Сборники
		|ГДЕ
		|	НЕ Сборники.ПометкаУдаления";
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	МассивСборников = Выгрузка.ВыгрузитьКолонку("Ссылка");
	Если МассивСборников.Количество() Тогда
		МассивСборников = ОбщегоНазначенияКлиентСервер.СмешатьМассив(МассивСборников, Гсч);
		РезультатФункции = МассивСборников[0];
	Иначе
		РезультатФункции = Справочники.Сборники.ПустаяСсылка();
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ВернутьСлучайныйСборник()

// Возвращает ссылку на текущего пользователя из параметра сеанса.
&НаСервереБезКонтекста
Функция ВернутьТекущегоПользователя()
	РезультатФункции = ПараметрыСеанса.ТекущийПользователь;
	Возврат РезультатФункции;
КонецФункции		// ВернутьТекущегоПользователя()

// Вовзращает массив выбранных сборников на форме.
&НаКлиентеНаСервереБезКонтекста
Функция СчитатьВыбранныеСборники(Форма)
	РезультатФункции = Новый Массив;
	Для Каждого ТекТаблицаСборников Из Форма.ТаблицаСборников Цикл
		Если ТекТаблицаСборников.Использование Тогда
			РезультатФункции.Добавить(ТекТаблицаСборников.Сборник);
		Иначе
			// Пользователь не выбрал сборник. Пропускаем.
		КонецЕсли;
	КонецЦикла;	
	Возврат РезультатФункции;
КонецФункции		 // СчитатьВыбранныеСборники()

// Определяет, что на форме выбран режим Случайного сборника.
&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРежимСлучайныйСборник(Форма)
	РезультатФункции = Ложь;
	ЗначениеРежимСлучайныйСборник = ПредопределенноеЗначение("Перечисление.РежимыВикторины.СлучайныйСборник");
	РезультатФункции = (Форма.РежимВикторины = ЗначениеРежимСлучайныйСборник);
	Возврат РезультатФункции;
КонецФункции		 // ЭтоРежимСлучайныйСборник()

// Определяет, что на форме выбран режим Восхождения.
&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРежимВосхождения(Форма)
	РезультатФункции = Ложь;
	ЗначениеРежимВосхождения = ПредопределенноеЗначение("Перечисление.РежимыВикторины.Восхождение");
	РезультатФункции = (Форма.РежимВикторины = ЗначениеРежимВосхождения);
	Возврат РезультатФункции;
КонецФункции		 // ЭтоРежимВосхождения()
 
// Управляет видимостью элементов на форме.
&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостью(Форма)
	Форма.Элементы.Применить.Доступность = Истина;
	РежимСлучайныйСборник = ЭтоРежимСлучайныйСборник(Форма);
	РежимВосхождение = ЭтоРежимВосхождения(Форма);
	ОтображатьВыборСборников = (РежимСлучайныйСборник ИЛИ РежимВосхождение);
	Форма.Элементы.Сборник.Видимость = НЕ ОтображатьВыборСборников;
	Форма.Элементы.ТаблицаСборников.Видимость = ОтображатьВыборСборников;
	Форма.Элементы.ГруппаКнопкиСборники.Видимость = ОтображатьВыборСборников;
	Если ОтображатьВыборСборников Тогда
		МассивВыбранных = СчитатьВыбранныеСборники(Форма);	
		Если МассивВыбранных.Количество() = 0 Тогда
			Форма.Элементы.Применить.Доступность = Ложь;
		Иначе
			// Проверка пройдена.
		КонецЕсли;
	Иначе
		// Проверка пройдена.
	КонецЕсли;
КонецПроцедуры		// УправлениеВидимостью()

// Заполняет таблицу сборников на форме.
&НаСервере
Процедура ЗаполнитьТаблицуСборников()
	ТаблицаСборников.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сборники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сборники КАК Сборники
		|ГДЕ
		|	НЕ Сборники.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сборники.Наименование";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ТаблицаСборников.Добавить();
		НоваяСтрока.Использование	 = Истина;
		НоваяСтрока.Сборник			 = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
КонецПроцедуры		// ЗаполнитьТаблицуСборников()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	#Если МобильноеПриложениеКлиент Тогда
		
	#Иначе
		Пользователь = ВернутьТекущегоПользователя();
	#КонецЕсли
	РежимВикторины = Перечисления.РежимыВикторины.СлучайныйСборник;
	Если ЗначениеЗаполнено(Параметры.Сборник) Тогда
		Сборник = Параметры.Сборник;
	Иначе
		Сборник = ВернутьСлучайныйСборник();
	КонецЕсли;
	ЗаполнитьТаблицуСборников();
	УправлениеВидимостью(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	Если ЗначениеЗаполнено(Пользователь) Тогда
		// Считаем выбранные сборники.
		МассивВыбранных = Новый Массив;
		РежимСлучайныйСборник = ЭтоРежимСлучайныйСборник(ЭтаФорма);
		Если РежимСлучайныйСборник Тогда
			МассивВыбранных = СчитатьВыбранныеСборники(ЭтаФорма);
		Иначе
			МассивВыбранных = Новый Массив;
		КонецЕсли;
		СписокВыбранных = Новый СписокЗначений;
		СписокВыбранных.ЗагрузитьЗначения(МассивВыбранных);
		// Передадим параметры.
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Пользователь", Пользователь);
		СтруктураПараметров.Вставить("РежимВикторины", РежимВикторины);
		СтруктураПараметров.Вставить("Сборник", Сборник);
		СтруктураПараметров.Вставить("ВыбранныеСборники", СписокВыбранных);
		МожноНачать = ((НЕ РежимСлучайныйСборник) ИЛИ (МассивВыбранных.Количество() > 0));
		Если МожноНачать Тогда
			Закрыть(СтруктураПараметров);
		Иначе
			ТекстСообщения = НСтр("ru = 'Для продолжения требуется выбрать хотя бы один сборник'");
			Сообщить(ТекстСообщения);
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("ru = 'Пожалуйста, выберите пользователя'");
		Сообщить(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСправку(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РазделСправки", "НастройкиВикторины");
	ОткрытьФорму("Обработка.ОтображениеСправки.Форма.Форма", СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура РежимВикториныПриИзменении(Элемент)
	УправлениеВидимостью(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСборниковИспользованиеПриИзменении(Элемент)
	УправлениеВидимостью(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого ТекТаблицаСборников Из ТаблицаСборников Цикл
		ТекТаблицаСборников.Использование = Ложь;
	КонецЦикла;	
	УправлениеВидимостью(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для Каждого ТекТаблицаСборников Из ТаблицаСборников Цикл
		ТекТаблицаСборников.Использование = Истина;
	КонецЦикла;	
	УправлениеВидимостью(ЭтаФорма);
КонецПроцедуры

Гсч = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
