// Заполняет реквизиты формы при создании на сервере.
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокОткрытыхКарт();
	ЗаполнитьСписокОткрытыхМодификаторов();
КонецПроцедуры		// ПриСозданииНаСервере()

// Заполняет реквизит СписокКарт открытыми картами.
//
&НаСервере
Процедура ЗаполнитьСписокОткрытыхКарт()
	МассивОткрытыхКарт = Справочники.Карты.ПолучитьОткрытыеКарты();
	Для Каждого Карта Из МассивОткрытыхКарт Цикл
		СписокКарт.Добавить(Карта);
	КонецЦикла;
КонецПроцедуры		// ЗаполнитьСписокОткрытыхКарт()

// Заполняет реквизит СписокМодификаторов открытыми модификаторами.
//
&НаСервере
Процедура ЗаполнитьСписокОткрытыхМодификаторов()
	МассивОткрытыхМодификаторов = Справочники.Модификаторы.ПолучитьОткрытыеМодификаторы();
	Для Каждого Модификатор Из МассивОткрытыхМодификаторов Цикл
		СписокМодификаторов.Добавить(Модификатор);
	КонецЦикла;
КонецПроцедуры		// ЗаполнитьСписокОткрытыхМодификаторов()
