// Заполняет реквизиты формы при создании на сервере.
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокОткрытыхКарт();
	ЗаполнитьСписокОткрытыхМодификаторов();
КонецПроцедуры		// ПриСозданииНаСервере()

// Заполняет реквизит СписокКарт открытыми картами.
//
&НаСервере
Процедура ЗаполнитьСписокОткрытыхКарт()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Карты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Карты КАК Карты
		|ГДЕ
		|	Карты.Открыта
		|	И НЕ Карты.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	Карты.Наименование";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокКарт.Добавить(Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры		// ЗаполнитьСписокОткрытыхКарт()

// Заполняет реквизит СписокМодификаторов открытыми модификаторами.
//
&НаСервере
Процедура ЗаполнитьСписокОткрытыхМодификаторов()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Модификаторы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Модификаторы КАК Модификаторы
		|ГДЕ
		|	Модификаторы.Открыт
		|	И НЕ Модификаторы.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	Модификаторы.Наименование";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокМодификаторов.Добавить(Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры		// ЗаполнитьСписокОткрытыхМодификаторов()
