
&НаКлиенте
Процедура ДекорацияТестированиеНажатие(Элемент)
	ОткрытьФорму("Обработка.ТестированиеЗнаний.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЛучшиеТестированныеКартинкаНажатие(Элемент)
	//ОткрытьФорму("Отчет.ПрогрессОбучения.Форма.ФормаОтчета");
	ОткрытьФорму("Обработка.ЛучшиеТестированные.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОбновлениеСборниковКартинкаНажатие(Элемент)
	ОткрытьФорму("Обработка.ОбновлениеСборников.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСправку(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РазделСправки", "ГлавнаяСтраница");
	ОткрытьФорму("Обработка.ОтображениеСправки.Форма.Форма", СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура ОценитьПриложение(Команда)

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПятьЗвездНажатие(Элемент)
	ЗапуститьПриложение("https://play.google.com/store/apps/details?id=ru.gigabyte_artur.gigabyte_artur");	
КонецПроцедуры

// Отображает актуальное представление пользователя ПользовательВход.
&НаСервере
Процедура ОбновитьПредставлениеПользователя(ПользовательВход)
	СтруктураДанныхПользователя = Справочники.Пользователи.ВернутьДанныеПользователя(ПользовательВход);
	Уровень = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураДанныхПользователя, "Уровень", 1);
	ПредставлениеПользователя = Строка(ТекПользователь) + " [" + Строка(Уровень) + "]";
	Элементы.ОткрытьПрофильПользователя.Заголовок = ПредставлениеПользователя;
КонецПроцедуры		// ОбновитьПредставлениеПользователя()	

// Отображает актуальное представление текущего пользователя.
&НаСервере
Процедура ОбновитьПредставлениеТекущегоПользователя()
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если ЗначениеЗаполнено(ТекПользователь) Тогда
		ОбновитьПредставлениеПользователя(ТекПользователь);
		Элементы.ОткрытьПрофильПользователя.Видимость = Истина;
	Иначе
		Элементы.ОткрытьПрофильПользователя.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры		// ОбновитьПредставлениеТекущегоПользователя()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьПредставлениеТекущегоПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрофильПользователя(Команда)
	ПоказатьЗначение(, ТекПользователь);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьЛичныеДанные" Тогда
		ОбновитьПредставлениеТекущегоПользователя();
	Иначе
		// Неизвестный вариант. Ничего не делаем.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСайтАвтораКартинкаНажатие(Элемент)
	ЗапуститьПриложение("https://livegig.ru/");	
КонецПроцедуры
