&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Считывание параметров формы в реквизиты
	ВариантДействия = Параметры.ВариантДействия;
	МаксимальноеЗдоровьеИгрока = Параметры.МаксимальноеЗдоровьеИгрока;
	МаксимальноеЗдоровьеПротивника = Параметры.МаксимальноеЗдоровьеПротивника;
	Противник = Параметры.Противник;
	Сила = Параметры.Сила;
	ТекущееЗдоровьеИгрока = Параметры.ТекущееЗдоровьеИгрока;
	ТекущееЗдоровьеПротивника = Параметры.ТекущееЗдоровьеПротивника;
	// Обновление индикаторов здоровья
	ОбновитьИндикаторыЗдоровья();
КонецПроцедуры

&НаСервере
Процедура ОбновитьИндикаторыЗдоровья()
	// Заполнение декорации здоровья игрока
	Элементы.ДекорацияЗдоровьеИгрока.Заголовок = 
		Формат(ТекущееЗдоровьеИгрока, "ЧГ=") + " / " + Формат(МаксимальноеЗдоровьеИгрока, "ЧГ=");
	
	// Заполнение декорации здоровья противника
	Элементы.ДекорацияЗдоровьеПротивника.Заголовок = 
		Формат(ТекущееЗдоровьеПротивника, "ЧГ=") + " / " + Формат(МаксимальноеЗдоровьеПротивника, "ЧГ=");
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры
