&НаСервере
Процедура ОтобразитьСправку(РазделСправки)
	Макет = Неопределено;
	// Получение макета.
	Если РазделСправки = "ГлавнаяСтраница" Тогда
		Макет = Обработки.ОтображениеСправки.ПолучитьМакет("МакетГлавнаяСтраница");
	ИначеЕсли РазделСправки = "НастройкиВикторины" Тогда
		Макет = Обработки.ОтображениеСправки.ПолучитьМакет("МакетНастройкиВикторины");		
	ИначеЕсли РазделСправки = "Викторина" Тогда
		Макет = Обработки.ОтображениеСправки.ПолучитьМакет("МакетВикторина");		
	ИначеЕсли РазделСправки = "ОбновлениеСборников" Тогда
		Макет = Обработки.ОтображениеСправки.ПолучитьМакет("МакетОбновлениеСборников");		
	ИначеЕсли РазделСправки = "ЛучшиеРезультаты" Тогда
		Макет = Обработки.ОтображениеСправки.ПолучитьМакет("МакетЛучшиеРезультаты");		
	Иначе
		Макет = Неопределено;
	КонецЕсли;
	// Загрузка макета.
	Если Макет <> Неопределено Тогда
		ТекстСправки = Макет.Область("R1C1").Текст;
	Иначе
		ТекстСправки = "";
	КонецЕсли;
КонецПроцедуры		// ОтобразитьСправку()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РазделСправки = Параметры.РазделСправки;
	ОтобразитьСправку(РазделСправки);
КонецПроцедуры
