
Процедура ПриЗаписи(Отказ)
	// Установим пометку удаления у подчинённых объектов.
	Если ПометкаУдаления Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задания.Ссылка,
		|	Задания.Владелец
		|ИЗ
		|	Справочник.Задания КАК Задания
		|ГДЕ
		|	НЕ Задания.ПометкаУдаления
		|	И Задания.Владелец = &Владелец";
		Запрос.УстановитьПараметр("Владелец", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Попытка
				ЗаданиеСсылка = ВыборкаДетальныеЗаписи.Ссылка;
				ЗаданиеОбъект = ЗаданиеСсылка.ПолучитьОбъект();
				ЗаданиеОбъект.ПометкаУдаления = Истина;
				ЗаданиеОбъект.Записать();
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось записать задание %Задание% по причине: %ОписаниеОшибки%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Задание%", ЗаданиеСсылка);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
				Сообщить(ТекстСообщения);
			КонецПопытки;
		КонецЦикла;
	Иначе
		// Не требуется изменять пометку удаления у зависимых элементов.
	КонецЕсли;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	Если СокрЛП(ИдентификаторСборника) = "" Тогда
		ИдентификаторСборника = Строка(Новый УникальныйИдентификатор);
	Иначе
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Автор = ТекПользователь.ИнформацияОбАвторе;
	Версия = "1.0";
	Сложность = Перечисления.СложностиСборников.ШестьОтветов;
КонецПроцедуры

