// Загружает в таблицу данные правильных ответов по сборнику СборникВход.
&НаСервере
Процедура СчитатьОтветы(СборникВход)
	ТаблицаВопросов.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаданияОтветыЗаданий.ТекстОтвета,
		|	ЗаданияОтветыЗаданий.Ссылка,
		|	ЗаданияОтветыЗаданий.Ссылка.ТекстВопросаЗадания КАК ТекстВопросаЗадания
		|ИЗ
		|	Справочник.Задания.ОтветыЗаданий КАК ЗаданияОтветыЗаданий
		|ГДЕ
		|	НЕ ЗаданияОтветыЗаданий.Ссылка.ПометкаУдаления
		|	И ЗаданияОтветыЗаданий.Ссылка.Владелец = &Владелец
		|	И ЗаданияОтветыЗаданий.Правильность
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТекстВопросаЗадания";
	Запрос.УстановитьПараметр("Владелец", СборникВход);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ТаблицаВопросов.Добавить();
		НоваяСтрока.Задание	 = ВыборкаДетальныеЗаписи.ТекстВопросаЗадания;
		НоваяСтрока.Ответ	 = ВыборкаДетальныеЗаписи.ТекстОтвета;
	КонецЦикла;
КонецПроцедуры		// СчитатьОтветы()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Сборник = Параметры.Сборник;
	СчитатьОтветы(Сборник);
КонецПроцедуры

&НаКлиенте
Процедура СборникПриИзменении(Элемент)
	СчитатьОтветы(Сборник);
КонецПроцедуры
