
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Получение золота из параметров формы
	Золото = Параметры.Золото;
	// Получение и заполнение модификаторов игрока из параметров формы
	МодификаторыИгрока = Новый СписокЗначений;
	Для каждого ЭлементСписка Из Параметры.Модификаторы Цикл
		МодификаторыИгрока.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
	// Заполнение таблицы МодификаторыНаВитрине
	ЗаполнитьМодификаторыНаВитрине();
КонецПроцедуры

// Выполняет заполнение таблицы модификаторов к покупке.
//
&НаСервере
Процедура ЗаполнитьМодификаторыНаВитрине()
	Гсч = Новый ГенераторСлучайныхЧисел;
	МодификаторыНаВитрине.Очистить();
	КоличествоДобавленных = 0;
	МаксимумКПокупке = 3;
	Пока КоличествоДобавленных < МаксимумКПокупке Цикл
		// Получаем случайный модификатор, исключая модификаторы игрока
		НовыйМодификатор = Справочники.Модификаторы.ВернутьМодификатор(Истина, Гсч, МодификаторыИгрока.ВыгрузитьЗначения());
		Если ЗначениеЗаполнено(НовыйМодификатор) Тогда
			// Проверяем, нет ли уже такого модификатора в витрине
			СтруктураПоиска = Новый Структура("Модификатор", НовыйМодификатор);
			НайденныеСтроки = МодификаторыНаВитрине.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = МодификаторыНаВитрине.Добавить();
				НоваяСтрока.Модификатор = НовыйМодификатор;
				СлучайнаяЦена = Гсч.СлучайноеЧисло(15, 30) * 10;
				НоваяСтрока.Цена = СлучайнаяЦена;
				КоличествоДобавленных = КоличествоДобавленных + 1;
			КонецЕсли;
		Иначе
			// Не удалось найти подходящий модификатор
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КупитьМодификатор(Команда)
	ТекДанные = Элементы.МодификаторыНаВитрине.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекМодификатор	 = ТекДанные.Модификатор;
		ТекЦена			 = ТекДанные.Цена;
		Если Золото < ТекЦена Тогда
			Сообщить("Недостаточно золота для покупки");
		Иначе
			// Уменьшаем золото на величину цены.
			Золото = Золото - ТекЦена;
			// Добавляем модификатор в список купленных
			КупленныеМодификаторы.Добавить(ТекМодификатор);
			// Удаляем модификатор из витрины
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Модификатор", ТекМодификатор);
			НайденныеСтроки = МодификаторыНаВитрине.НайтиСтроки(СтруктураПоиска);
			Для Каждого ТекНайденныеСтроки Из НайденныеСтроки Цикл
				МодификаторыНаВитрине.Удалить(ТекНайденныеСтроки);
			КонецЦикла;	
		КонецЕсли;
	Иначе
		Сообщить("Требуется выбрать модифкатор");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьПокупки(Команда)
	СтруктураЗакрытия = Новый Структура;
	СтруктураЗакрытия.Вставить("Золото", Золото);
	СтруктураЗакрытия.Вставить("КупленныеМодификаторы", КупленныеМодификаторы);
	Закрыть(СтруктураЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура КупитьКарту(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
