&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Получение золота из параметров формы
	Если Параметры.Золото <> Неопределено Тогда
		Золото = Параметры.Золото;
	КонецЕсли;
	
	// Получение и заполнение модификаторов игрока из параметров формы
	Если Параметры.Модификаторы <> Неопределено Тогда
		МодификаторыИгрока = Новый СписокЗначений;
		Для каждого ЭлементСписка Из Параметры.Модификаторы Цикл
			МодификаторыИгрока.Добавить(ЭлементСписка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
