
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Считывание параметров.
	РукаИгрока.Очистить();
	Если ТипЗнч(Параметры.РукаИгрока) = Тип("Массив") Тогда
		Для Каждого ТекРукаИгрока Из Параметры.РукаИгрока Цикл
			НоваяСтрока = РукаИгрока.Добавить();
			НоваяСтрока.Карта				 = ТекРукаИгрока.Карта;
			НоваяСтрока.ИдентификаторКарты	 = ТекРукаИгрока.ИдентификаторКарты;
		КонецЦикла;
	Иначе
		// Нет данных для заполнения руки игрока.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазыгратьКарту(Команда)
	ТекДанные = Элементы.РукаИгрока.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекИдентификатор = ТекДанные.ИдентификаторКарты;
		Закрыть(ТекИдентификатор);
	Иначе
		// Строка не выбрана. Ничего не делаем.
	КонецЕсли;
КонецПроцедуры
