
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Считывание параметров.
	Энергия = Параметры.Энергия;
	РукаИгрока.Очистить();
	Если ТипЗнч(Параметры.РукаИгрока) = Тип("Массив") Тогда
		Для Каждого ТекРукаИгрока Из Параметры.РукаИгрока Цикл
			НоваяСтрока = РукаИгрока.Добавить();
			НоваяСтрока.Карта = ТекРукаИгрока.Карта;
			НоваяСтрока.ИдентификаторКарты = ТекРукаИгрока.ИдентификаторКарты;
		КонецЦикла;
	Иначе
		// Нет данных для заполнения руки игрока.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазыгратьКарту(Команда)
	ТекДанные = Элементы.РукаИгрока.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Стоимость = ПолучитьСтоимостьКарты(ТекДанные.Карта);
		Энергия = Энергия - Стоимость;
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Энергия", Энергия);
		СтруктураПараметров.Вставить("ИдентификаторКарты", ТекДанные.ИдентификаторКарты);
		Закрыть(СтруктураПараметров);
	Иначе
		// Строка не выбрана. Ничего не делаем.
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтоимостьКарты(Карта)
	Если ЗначениеЗаполнено(Карта) Тогда
		Возврат Карта.Стоимость;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции
