
// Проверяет достижения пользователя при старте работы системы.
Процедура ПроверитьДостиженияПриНачалеРаботыСистемы(ПользовательВход)
	// Установлено 15 сборников.
	Если ДостиженияКлиентСервер.ЕстьДостижениеУстановленоПятнадцатьСборников() Тогда
		ДостижениеУстановленоПятнадцатьСборников = ПредопределенноеЗначение("Перечисление.Достижения.УстановленоПятнадцатьСборников");
		ОбщегоНазначенияВызовСервера.ПроверитьИВыдатьДостижениеПользователю(ПользовательВход, ДостижениеУстановленоПятнадцатьСборников);
	Иначе
		// Достижение ещё не получено.
	КонецЕсли;	
КонецПроцедуры		// ПроверитьДостиженияПриНачалеРаботыСистемы()

Процедура ПриНачалеРаботыСистемы()
	// Текущий пользователь.
	ТекПользователь = ОбщегоНазначенияВызовСервера.ТекущийПользователь();
	Если ЗначениеЗаполнено(ТекПользователь) Тогда
		НаименованиеПользователя = ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизита(ТекПользователь, "Наименование");
		Если СокрЛП(НаименованиеПользователя) = "" Тогда
			ПоказатьЗначение(, ТекПользователь);      
		Иначе
			// Не требуется изменять имя пользователя.
		КонецЕсли;
	Иначе
		НужноОткрыватьПользователя = Ложь;
	КонецЕсли;
	// Предопределенный сборник.
	ЕстьСборник = ОбщегоНазначенияВызовСервера.ЕстьСборникСИдентификатором("4a757e86-23c1-480d-9d96-36329dba1822");
	Если НЕ ЕстьСборник Тогда
		Сообщить(НСтр("ru = 'Будет загружен предопределённый сборник. Пожалуйста, ждите.'"));
		РезультатЗагрузки = ОбщегоНазначенияВызовСервера.ЗагрузитьПредопределенныйМакет();
		Если РезультатЗагрузки Тогда
			Сообщить(НСтр("ru = 'Загрузка завершилась успешно'"));
		Иначе
			Сообщить(НСтр("ru = 'Не удалось загрузить'"));
		КонецЕсли;
	Иначе
		// Сборник есть. Ничего не делаем.
	КонецЕсли;
	// Количество заданий в раунде.
	ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстант();
	// Достижения.
	ПроверитьДостиженияПриНачалеРаботыСистемы(ТекПользователь);
КонецПроцедуры
