
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	ТекПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	ТекПользовательИБСтрока = Строка(ТекПользовательИБ);
	Пользователь = Справочники.Пользователи.НайтиПоНаименованию(ТекПользовательИБСтрока);
	Если Пользователь.Пустая() Тогда
		Пользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовоеНаименование = "";
		Если ЗначениеЗаполнено(СокрЛП(НовоеНаименование)) Тогда
			НовоеНаименование = ТекПользовательИБСтрока;
		Иначе
			НовоеНаименование = НСтр("ru = 'Игрок1'");
		КонецЕсли;
		Пользователь.Наименование = НовоеНаименование;
		Пользователь.Записать();
		ТекстСообщения = НСтр("ru = 'Пользователь %Наименование% был зарегистрирован в системе.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Наименование%", Строка(НовоеНаименование));
		Сообщить(ТекстСообщения);
		Пользователь = Пользователь.Ссылка;
	КонецЕсли;	
	ПараметрыСеанса.ТекущийПользователь = Пользователь;   
КонецПроцедуры
