&НаСервере
Функция ВывестиКартинкуСборника(СборникВход)
	РезультатФункции = Ложь;
	Если ЗначениеЗаполнено(СборникВход) Тогда
		Адрес = "";
		КартинкаХранилище = СборникСсылка.КартинкаСборника;
		КартинкаВрем = КартинкаХранилище.Получить();
		Если КартинкаВрем <> Неопределено Тогда
			Адрес = ПоместитьВоВременноеХранилище(КартинкаВрем, УникальныйИдентификатор);
			Если ЭтоАдресВременногоХранилища(Адрес) Тогда
				КартинкаОтображение = Адрес;
				РезультатФункции = Истина;
			Иначе
				РезультатФункции = Ложь;		// Не удалось поместить во временное хранилище.
			КонецЕсли;
		Иначе
			РезультатФункции = Ложь;			// В хранилище базы пустое значение.
		КонецЕсли;
	Иначе
		РезультатФункции = Ложь;				// Передан пустой сборник.
	КонецЕсли;
	Возврат РезультатФункции;	
КонецФункции		// ВывестиКартинкуСборника()	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДоступнаяВерсия			 = Параметры.ДоступнаяВерсия;
	УстановленнаяВерсия		 = Параметры.УстановленнаяВерсия;
	СборникСсылка			 = Параметры.СборникСсылка;
	НаименованиеСборника	 = Параметры.НаименованиеСборника;
	РезультатВыводаКартинки = ВывестиКартинкуСборника(СборникСсылка);
	Элементы.КартинкаОтображение.Видимость = РезультатВыводаКартинки;
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСборник(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Сборник", СборникСсылка);
	ОткрытьФорму("Обработка.ТестированиеЗнаний.Форма.Форма", ПараметрыФормы);
КонецПроцедуры
