
// Возвращает структуру, содержащую данные пользователя ПользовательВход.
Функция ВернутьДанныеПользователя(ПользовательВход) Экспорт
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Пользователь", Справочники.Пользователи.ПустаяСсылка());
	РезультатФункции.Вставить("Уровень", 1);
	РезультатФункции.Вставить("Опыт", 0);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеПользователей.Пользователь КАК Пользователь,
		|	ДанныеПользователей.Уровень КАК Уровень,
		|	ДанныеПользователей.Опыт КАК Опыт
		|ИЗ
		|	РегистрСведений.ДанныеПользователей КАК ДанныеПользователей
		|ГДЕ
		|	ДанныеПользователей.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", ПользовательВход);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезультатФункции.Вставить("Пользователь", ВыборкаДетальныеЗаписи.Пользователь);
		РезультатФункции.Вставить("Уровень", ВыборкаДетальныеЗаписи.Уровень);
		РезультатФункции.Вставить("Опыт", ВыборкаДетальныеЗаписи.Опыт);
	КонецЦикла;
	Возврат РезультатФункции;
КонецФункции		 // ВернутьДанныеПользователя()	