Процедура СоздатьПользователя(ИмяВход)
	//НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	//НовыйПользователь.АутентификацияСтандартная = Истина;
	//НовыйПользователь.Имя = ИмяВход;
	//НовыйПользователь.ПолноеИмя = ИмяВход;
	//
	//ИмяРоли = Метаданные.Роли.ПолныеПрава;
	//НовыйПользователь.Роли.Добавить(ИмяРоли);
	//Если ПользователиИнформационнойБазы.НайтиПоИмени(НовыйПользователь.Имя) = Неопределено Тогда     
	//	НовыйПользователь.Записать();
	//	поль = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяВход);
	//Иначе 
	//	Сообщить("Пользователь с указанным именем уже зарегистрирован " + """" + НовыйПользователь.Имя + """");
	//КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ЭтоНовый() Тогда
		СоздатьПользователя(Наименование);
	Иначе
		// Не обновляем пользователей.
	КонецЕсли;
КонецПроцедуры
