// Дополняет массив МассивПриемник значениями из массива МассивИсточник.
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения.
//  МассивИсточник - Массив - массив значений для заполнения,
//	ТолькоУникальныеЗначения - булево, необязательный, если истина, 
//		то в массив будут включены только те значения, которых в нем еще нет, причем единожды.
// 
Процедура ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения = Ложь) Экспорт
	
	Если ТолькоУникальныеЗначения Тогда
		
		УникальныеЗначения = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			УникальныеЗначения.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			Если УникальныеЗначения[Значение] = Неопределено Тогда
				МассивПриемник.Добавить(Значение);
				УникальныеЗначения.Вставить(Значение, Истина);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры		// ДополнитьМассив()

// Удаляет повторяющиеся элементы массива.
//
// Параметры:
//  Массив - Массив - массив произвольных значений.
//
// Возвращаемое значение:
//  Массив;
Функция СвернутьМассив(Массив) Экспорт
	Результат = Новый Массив;
	ДополнитьМассив(Результат, Массив, Истина);
	Возврат Результат;
КонецФункции		// СвернутьМассив()

// Возвращает значение свойства структуры.
//
// Параметры:
//   Структура - Структура, ФиксированнаяСтруктура - Объект, из которого необходимо прочитать значение ключа.
//   Ключ - Строка - Имя свойства структуры, для которого необходимо прочитать значение.
//   ЗначениеПоУмолчанию - Произвольный - Необязательный. Возвращается когда в структуре нет значения по указанному
//                                        ключу.
//       Для скорости рекомендуется передавать только быстро вычисляемые значения (например примитивные типы),
//       а инициализацию более тяжелых значений выполнять после проверки полученного значения (только если это
//       требуется).
//
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры. ЗначениеПоУмолчанию если в структуре нет указанного свойства.
//
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если Структура = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Результат = ЗначениеПоУмолчанию;
	Если Структура.Свойство(Ключ, Результат) Тогда
		Возврат Результат;
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
КонецФункции

Функция РазложитьСтрокуНаПодстроки(ВходящаяСтрока, Разделитель) Экспорт
	МассивСтрок = Новый Массив();
	ВходящаяСтрока = СтрЗаменить(ВходящаяСтрока, Разделитель, Символы.ПС);
	Для ИндексСтроки = 1 По СтрЧислоСтрок(ВходящаяСтрока) Цикл
		Подстрока = СтрПолучитьСтроку(ВходящаяСтрока, ИндексСтроки);
		МассивСтрок.Добавить(Подстрока);
	КонецЦикла;
	Возврат МассивСтрок;
КонецФункции		// РазложитьСтрокуНаПодстроки() 

// Возвращает копию массива, где все элементы переставлены местами.
Функция СмешатьМассив(МассивВход, Гсч) Экспорт
	// Инициализация.
	РезультатФункции = Новый Массив;
	Для Каждого ТекМассивВход Из МассивВход Цикл
		РезультатФункции.Добавить(ТекМассивВход);
	КонецЦикла;
	// Перемешивание.
	КоличествоЭлементов = РезультатФункции.Количество();
	Для Счетчик = 0 По КоличествоЭлементов-1 Цикл
		НовыйНомер = Гсч.СлучайноеЧисло(0, КоличествоЭлементов-1);
		Врем = РезультатФункции[Счетчик];
		РезультатФункции[Счетчик] = РезультатФункции[НовыйНомер];
		РезультатФункции[НовыйНомер] = Врем;
	КонецЦикла;
	// Вывод результата.
	Возврат РезультатФункции;
КонецФункции

// По опыту ОпытВход возвращает уровень игрока.
Функция ВернутьУровеньПоОпыту(ОпытВход) Экспорт
	РезультатФункции = 1;
	Если ОпытВход < 10 Тогда
		РезультатФункции = 1;
	ИначеЕсли ОпытВход < 23 Тогда
		РезультатФункции = 2;
	ИначеЕсли ОпытВход < 30 Тогда
		РезультатФункции = 3;
	ИначеЕсли ОпытВход < 38 Тогда
		РезультатФункции = 4;
	ИначеЕсли ОпытВход < 50 Тогда
		РезультатФункции = 5;
	ИначеЕсли ОпытВход < 65 Тогда
		РезультатФункции = 6;
	ИначеЕсли ОпытВход < 85 Тогда
		РезультатФункции = 7;
	ИначеЕсли ОпытВход < 110 Тогда
		РезультатФункции = 8;
	ИначеЕсли ОпытВход < 150 Тогда
		РезультатФункции = 9;
	ИначеЕсли ОпытВход < 190 Тогда
		РезультатФункции = 10;
	ИначеЕсли ОпытВход < 250 Тогда
		РезультатФункции = 11;
	ИначеЕсли ОпытВход < 320 Тогда
		РезультатФункции = 12;
	ИначеЕсли ОпытВход < 410 Тогда
		РезультатФункции = 13;
	ИначеЕсли ОпытВход < 540 Тогда
		РезультатФункции = 14;
	ИначеЕсли ОпытВход < 700 Тогда
		РезультатФункции = 15;
	ИначеЕсли ОпытВход < 900 Тогда
		РезультатФункции = 16;
	ИначеЕсли ОпытВход < 1200 Тогда
		РезультатФункции = 17;
	ИначеЕсли ОпытВход < 1500 Тогда
		РезультатФункции = 18;
	ИначеЕсли ОпытВход < 2000 Тогда
		РезультатФункции = 19;
	ИначеЕсли ОпытВход < 2500 Тогда
		РезультатФункции = 20;
	ИначеЕсли ОпытВход < 3300 Тогда
		РезультатФункции = 21;
	ИначеЕсли ОпытВход < 4400 Тогда
		РезультатФункции = 22;
	ИначеЕсли ОпытВход < 5700 Тогда
		РезультатФункции = 23;
	ИначеЕсли ОпытВход < 7400 Тогда
		РезультатФункции = 24;
	ИначеЕсли ОпытВход < 9600 Тогда
		РезультатФункции = 25;
	ИначеЕсли ОпытВход < 12500 Тогда
		РезультатФункции = 26;
	ИначеЕсли ОпытВход < 16300 Тогда
		РезультатФункции = 27;
	ИначеЕсли ОпытВход < 21000 Тогда
		РезультатФункции = 28;
	ИначеЕсли ОпытВход < 27000 Тогда
		РезультатФункции = 29;
	ИначеЕсли ОпытВход < 36000 Тогда
		РезультатФункции = 30;
	ИначеЕсли ОпытВход < 46000 Тогда
		РезультатФункции = 31;
	ИначеЕсли ОпытВход < 60000 Тогда
		РезультатФункции = 32;
	ИначеЕсли ОпытВход < 78000 Тогда
		РезультатФункции = 33;
	ИначеЕсли ОпытВход < 100000 Тогда
		РезультатФункции = 34;
	ИначеЕсли ОпытВход < 132000 Тогда
		РезультатФункции = 35;
	ИначеЕсли ОпытВход < 170000 Тогда
		РезультатФункции = 36;
	ИначеЕсли ОпытВход < 220000 Тогда
		РезультатФункции = 37;
	ИначеЕсли ОпытВход < 290000 Тогда
		РезультатФункции = 38;
	ИначеЕсли ОпытВход < 380000 Тогда
		РезультатФункции = 39;
	ИначеЕсли ОпытВход < 500000 Тогда
		РезультатФункции = 40;
	ИначеЕсли ОпытВход < 630000 Тогда
		РезультатФункции = 41;
	ИначеЕсли ОпытВход < 830000 Тогда
		РезультатФункции = 42;
	ИначеЕсли ОпытВход < 1000000 Тогда
		РезультатФункции = 43;
	ИначеЕсли ОпытВход < 1400000 Тогда
		РезультатФункции = 44;
	Иначе
		РезультатФункции = 45;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ВернутьУровеньПоОпыту()

// Возвращает количество слогов, встречающихся в ответе ПравильныйОтветВход.
// Если цифр нет - возвращает -1.
Функция РассчитатьКоличествоСлогов(ПравильныйОтветВход) Экспорт
	РезультатФункции = -1;
	Цифры = "аеёиоуыэяюЕЭОАЫЯИЮeyuioaEYIOA";
	Сумма = 0;
	ЕстьСлог = Ложь;
	Для Счетчик = 1 По СтрДлина(ПравильныйОтветВход) Цикл
		ТекСимвол = Сред(ПравильныйОтветВход, Счетчик, 1);
		Если СтрНайти(Цифры, ТекСимвол) <> 0 Тогда
			ЕстьСлог = Истина;
			Сумма = Сумма + 1;
		Иначе
			// Не цифровой символ. выполняем далее.
		КонецЕсли;
	КонецЦикла;	
	Если ЕстьСлог Тогда
		РезультатФункции = Сумма;
	Иначе
		РезультатФункции = -1;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// РассчитатьКоличествоСлогов()

// Возвращает сумму цифр, встречающихся в ответе ПравильныйОтветВход.
// Если цифр нет - возвращает -1.
Функция РассчитатьСуммуЦифрОтвета(ПравильныйОтветВход) Экспорт
	РезультатФункции = -1;
	Цифры = "0123456789";
	Сумма = 0;
	ЕстьЦифра = Ложь;
	Для Счетчик = 1 По СтрДлина(ПравильныйОтветВход) Цикл
		ТекСимвол = Сред(ПравильныйОтветВход, Счетчик, 1);
		Если СтрНайти(Цифры, ТекСимвол) <> 0 Тогда
			ЕстьЦифра = Истина;
			НовоеЧисло = Число(ТекСимвол);
			Сумма = Сумма + НовоеЧисло;
		Иначе
			// Не цифровой символ. выполняем далее.
		КонецЕсли;
	КонецЦикла;	
	Если ЕстьЦифра Тогда
		РезультатФункции = Сумма;
	Иначе
		РезультатФункции = -1;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// РассчитатьСуммуЦифрОтвета()

// Возвращает содержащийся в строке спец-символ. Если таковых нет - возвращает пустую строку.
Функция СодержитСпецсимвол(СтрокаВход) Экспорт
	РезультатФункции = "";
	НаборСимволов = "+-*/,.!""№;%:?()@#$&~'`";
	Для Счетчик = 1 По СтрДлина(НаборСимволов) Цикл
		ТекСпецСимвол = Сред(НаборСимволов, Счетчик, 1);
		Если СтрНайти(СтрокаВход, ТекСпецСимвол) <> 0 Тогда
			РезультатФункции = ТекСпецСимвол;
		Иначе
			// Выполняем поиск далее.
		КонецЕсли;
	КонецЦикла;	
	Возврат РезультатФункции;
КонецФункции		// СодержитСпецсимвол()

// Определяет, совпадают ли первые буквы вопроса и ответа.
Функция СопадаютПервыебуквы(ТекстВопросаВход, ПравильныйОтветВход) Экспорт
	РезультатФункции = Ложь;
	Если (СтрДлина(ТекстВопросаВход) > 0) И (СтрДлина(ПравильныйОтветВход) > 0) Тогда
		ПервыйСимволВопроса = Сред(ТекстВопросаВход, 1, 1);
		ПервыйСимволОтвета = Сред(ПравильныйОтветВход, 1, 1);
		РезультатФункции = (ПервыйСимволВопроса = ПервыйСимволОтвета);
	Иначе
		РезультатФункции = Ложь;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// СопадаютПервыебуквы()

// Определяет, совпадают ли последние буквы вопроса и ответа.
Функция СопадаютПоследниеБуквы(ТекстВопросаВход, ПравильныйОтветВход) Экспорт
	РезультатФункции = Ложь;
	Если (СтрДлина(ТекстВопросаВход) > 0) И (СтрДлина(ПравильныйОтветВход) > 0) Тогда
		ПоследнийСимволВопроса = Сред(ТекстВопросаВход, СтрДлина(ТекстВопросаВход), 1);
		ПоследнийСимволОтвета = Сред(ПравильныйОтветВход, СтрДлина(ПравильныйОтветВход), 1);
		РезультатФункции = (ПоследнийСимволВопроса = ПоследнийСимволОтвета);
	Иначе
		РезультатФункции = Ложь;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// СопадаютПоследниеБуквы()

// Определяет, заканчивается ли ответ на одну и ту же букву, что и начинается.
Функция ОтветЗаканчиваетсяНачинаетсяНаОднуБукву(ПравильныйОтветВход) Экспорт
	РезультатФункции = Ложь;
	Если (СтрДлина(ПравильныйОтветВход) > 1) Тогда
		ПервыйСимволОтвета = Сред(ПравильныйОтветВход, 1, 1);
		ПоследнийСимволОтвета = Сред(ПравильныйОтветВход, СтрДлина(ПравильныйОтветВход), 1);
		РезультатФункции = (ПервыйСимволОтвета = ПоследнийСимволОтвета);
	Иначе
		РезультатФункции = Ложь;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ОтветЗаканчиваетсяНачинаетсяНаОднуБукву()

// Рассчитывает количество слов в ответе ПравильныйОтветВход.
Функция КоличествоСлов(ПравильныйОтветВход) Экспорт
	РезультатФункции = 1;
	ПредСимвол = "";
	Для Счетчик = 1 По СтрДлина(ПравильныйОтветВход) Цикл
		ТекСимвол = Сред(ПравильныйОтветВход, Счетчик, 1);
		Если ТекСимвол = " " И ПредСимвол <> " " Тогда
			РезультатФункции = РезультатФункции + 1;
		Иначе
			// Выполняем поиск далее.
		КонецЕсли;
		ПредСимвол = ТекСимвол;
	КонецЦикла;	
	Возврат РезультатФункции;
КонецФункции		// КоличествоСлов()

// Возвращает текст подсказки для ответа ПравильныйОтветВход
// по вопросу ТекстВопросаВход.
Функция ПолучитьТекстПодсказки(ТекстВопросаВход, ПравильныйОтветВход) Экспорт
	РезультатФункции = "Нет подсказки";
	СпецСимвол = СодержитСпецсимвол(ПравильныйОтветВход);
	КоличествоСлов = КоличествоСлов(ПравильныйОтветВход);
	СуммаЦифрОтвета = РассчитатьСуммуЦифрОтвета(ПравильныйОтветВход);
	КоличествоСлогов = РассчитатьКоличествоСлогов(ПравильныйОтветВход);
	Если СуммаЦифрОтвета <> -1 Тогда
		РезультатФункции = "Сумма цифр равна " + Строка(СуммаЦифрОтвета);
	ИначеЕсли СпецСимвол <> "" Тогда
		РезультатФункции = "Содержит '" + Строка(СпецСимвол) + "'";  
	ИначеЕсли СопадаютПервыеБуквы(ТекстВопросаВход, ПравильныйОтветВход) Тогда
		РезультатФункции = "Совпадают первые буквы в вопросе и ответе";
	ИначеЕсли СопадаютПоследниеБуквы(ТекстВопросаВход, ПравильныйОтветВход) Тогда
		РезультатФункции = "Совпадают последние буквы в вопросе и ответе";	
	ИначеЕсли ОтветЗаканчиваетсяНачинаетсяНаОднуБукву(ПравильныйОтветВход) Тогда
		РезультатФункции = "Ответ заканчивается и начинается на одну букву";	
	ИначеЕсли КоличествоСлов > 1 Тогда
		РезультатФункции = "В ответе " + Строка(КоличествоСлов) + " слов";	
	ИначеЕсли (СтрДлина(ПравильныйОтветВход) < 4) ИЛИ (СтрДлина(ПравильныйОтветВход) > 10) Тогда
		РезультатФункции = Строка(СтрДлина(ПравильныйОтветВход)) + " букв";	
	ИначеЕсли КоличествоСлогов <> -1 Тогда	
		РезультатФункции = Строка(КоличествоСлогов) + " слогов.";
	Иначе
		РезультатФункции = "Нет подсказки";
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ПолучитьТекстПодсказки()

// Преобразует номер правильного ответа ИсходныйНомерПравильногоОтветаВход
// в номер ответа на командах формы, ориентируясь на сложность сборника 
// СборникВход.
Функция ПреобразоватьНомерПравильногоОтвета(ИсходныйНомерПравильногоОтветаВход, СложностьВход) Экспорт
	РезультатФункции = ИсходныйНомерПравильногоОтветаВход;
	Если СложностьВход = ПредопределенноеЗначение("Перечисление.СложностиСборников.ШестьОтветов") Тогда
		РезультатФункции = ИсходныйНомерПравильногоОтветаВход;
	ИначеЕсли СложностьВход = ПредопределенноеЗначение("Перечисление.СложностиСборников.ЧетыреОтвета") Тогда
		Если ИсходныйНомерПравильногоОтветаВход = 4 Тогда
			РезультатФункции = 5;
		ИначеЕсли ИсходныйНомерПравильногоОтветаВход = 3 Тогда
			РезультатФункции = 4;
		Иначе	
			РезультатФункции = ИсходныйНомерПравильногоОтветаВход;
		КонецЕсли;	
	ИначеЕсли СложностьВход = ПредопределенноеЗначение("Перечисление.СложностиСборников.ПустаяСсылка") Тогда
		РезультатФункции = ИсходныйНомерПравильногоОтветаВход;
	Иначе
		РезультатФункции = ИсходныйНомерПравильногоОтветаВход;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ПреобразоватьНомерПравильногоОтвета()
