&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НомерЭтапа = Параметры.НомерЭтапа;
	Если НомерЭтапа > 9 Тогда
		Гсч = Новый ГенераторСлучайныхЧисел;
		ТекстНаграды = "";
		Если Гсч.СлучайноеЧисло(0, 1) = 0 Тогда
			ОткрытаяКарта = Справочники.Карты.ОткрытьСлучайнуюКарту();
			Если ЗначениеЗаполнено(ОткрытаяКарта) Тогда
				ТекстНаграды = "Открыта карта: " + ОткрытаяКарта.Наименование + ".";
			КонецЕсли;
		Иначе
			ОткрытыйМодификатор = Справочники.Модификаторы.ОткрытьСлучайныйМодификатор();
			Если ЗначениеЗаполнено(ОткрытыйМодификатор) Тогда
				ТекстНаграды = "Открыт модификатор: " + ОткрытыйМодификатор.Наименование + ".";
			КонецЕсли;
		КонецЕсли;
		Если ТекстНаграды = "" Тогда
			ТекстНаграды = "Все возможные награды разблокированы ранее.";
		КонецЕсли;
		Элементы.ДекорацияНаграды.Заголовок = ТекстНаграды;
	КонецЕсли;
КонецПроцедуры
