// Возвращает таблицу значений, содержащую данные о лучших тестированных.
&НаСервере
Функция ПолучитьТаблицуЛучших(СборникВход)
	РезультатФункции = Новый ТаблицаЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 10
		|	РезультатыТестированияЗнаний.Сборник,
		|	РезультатыТестированияЗнаний.Пользователь,
		|	СУММА(РезультатыТестированияЗнаний.ЗаданоВопросов) КАК ЗаданоВопросов,
		|	СУММА(РезультатыТестированияЗнаний.ОтвеченоВерно) КАК ОтвеченоВерно,
		|	СУММА(ВЫБОР
		|			КОГДА РезультатыТестированияЗнаний.ЗаданоВопросов <> 0
		|				ТОГДА РезультатыТестированияЗнаний.ОтвеченоВерно * (РезультатыТестированияЗнаний.ОтвеченоВерно / РезультатыТестированияЗнаний.ЗаданоВопросов) * (РезультатыТестированияЗнаний.ОтвеченоВерно / РезультатыТестированияЗнаний.ЗаданоВопросов)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Баллы
		|ИЗ
		|	РегистрСведений.РезультатыТестированияЗнаний КАК РезультатыТестированияЗнаний
		|ГДЕ
		|	РезультатыТестированияЗнаний.Сборник = &Сборник
		|
		|СГРУППИРОВАТЬ ПО
		|	РезультатыТестированияЗнаний.Сборник,
		|	РезультатыТестированияЗнаний.Пользователь
		|
		|УПОРЯДОЧИТЬ ПО
		|	Баллы УБЫВ";
	Запрос.УстановитьПараметр("Сборник", СборникВход);
	РезультатЗапроса = Запрос.Выполнить();
	РезультатФункции = РезультатЗапроса.Выгрузить();
	Возврат РезультатФункции;
КонецФункции

// Выводит на форму актуальные данные по лучшим тестированным.
&НаСервере
Процедура ОбновитьТаблицуЛучших()
	ТаблицаЛучших.Очистить();
	НоваяТаблицаЛучших = ПолучитьТаблицуЛучших(СборникОтбор);
	Для Каждого ТекНоваяТаблицаЛучших Из НоваяТаблицаЛучших Цикл
		НоваяСтрока = ТаблицаЛучших.Добавить();
		НоваяСтрока.Сборник			 = ТекНоваяТаблицаЛучших.Сборник;
		НоваяСтрока.Пользователь	 = ТекНоваяТаблицаЛучших.Пользователь;
		НоваяСтрока.ЗаданоВопросов	 = ТекНоваяТаблицаЛучших.ЗаданоВопросов;
		НоваяСтрока.ОтвеченоВерно	 = ТекНоваяТаблицаЛучших.ОтвеченоВерно;
		НоваяСтрока.Баллы			 = ТекНоваяТаблицаЛучших.Баллы;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьТаблицуЛучших();
КонецПроцедуры

&НаКлиенте
Процедура СборникОтборПриИзменении(Элемент)
	ОбновитьТаблицуЛучших();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСправку(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РазделСправки", "ЛучшиеРезультаты");
	ОткрытьФорму("Обработка.ОтображениеСправки.Форма.Форма", СтруктураПараметров);
КонецПроцедуры
