
&НаКлиенте
Процедура КомандаНаградаЗолото(Команда)
	СтруктураЗакрытия = Новый Структура();
	СтруктураЗакрытия.Вставить("Награда", ПредопределенноеЗначение("Перечисление.ВидыПараметровИгроков.Золото"));
	СтруктураЗакрытия.Вставить("Размер", 5);
	Закрыть(СтруктураЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура КомандаНаградаКарта(Команда)
	СтруктураЗакрытия = Новый Структура();
	СтруктураЗакрытия.Вставить("Награда", ПредопределенноеЗначение("Справочник.Карты.ПустаяСсылка"));
	СтруктураЗакрытия.Вставить("Размер", 2);
	Закрыть(СтруктураЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура КомандаНаградаУрон(Команда)
	СтруктураЗакрытия = Новый Структура();
	СтруктураЗакрытия.Вставить("Награда", ПредопределенноеЗначение("Перечисление.ВариантыДействийПротивников.Атака"));
	СтруктураЗакрытия.Вставить("Размер", 8);
	Закрыть(СтруктураЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура КомандаНаградаЭнергия(Команда)
	СтруктураЗакрытия = Новый Структура();
	СтруктураЗакрытия.Вставить("Награда", ПредопределенноеЗначение("Перечисление.ВидыПараметровИгроков.Энергия"));
	СтруктураЗакрытия.Вставить("Размер", 1);
	Закрыть(СтруктураЗакрытия);
КонецПроцедуры
