&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Окрытие 3 карт.
	МассивОткрытыхКарт = Новый Массив;
	Для Счетчик = 1 По 3 Цикл
		ОткрытаяКарта = Справочники.Карты.ОткрытьСлучайнуюКарту();
		Если ЗначениеЗаполнено(ОткрытаяКарта) Тогда
			МассивОткрытыхКарт.Добавить(ОткрытаяКарта);
		КонецЕсли;
	КонецЦикла;
	// Открытие модификатора.
	ОткрытыйМодификатор = Справочники.Модификаторы.ОткрытьСлучайныйМодификатор();
	// Добавление текста открытия карт.
	ТекстОткрытия = "";
	Если МассивОткрытыхКарт.Количество() > 0 Тогда
		ИменаКарт = Новый Массив;
		Для Каждого Карта Из МассивОткрытыхКарт Цикл
			ИменаКарт.Добавить("[" + Карта.Наименование + "]");
		КонецЦикла;
		ТекстОткрытия = ТекстОткрытия + "Открыты карты: " + СтрСоединить(ИменаКарт, ", ") + ".";
	КонецЕсли;
	ТекстОткрытия = ТекстОткрытия + Символы.ПС;
	// Добавление текста открытия модификатора.
	Если ЗначениеЗаполнено(ОткрытыйМодификатор) Тогда
		Если ТекстОткрытия <> "" Тогда
			ТекстОткрытия = ТекстОткрытия + " ";
		КонецЕсли;
		ТекстОткрытия = ТекстОткрытия + "Открыт модификатор: [" + ОткрытыйМодификатор.Наименование + "].";
	КонецЕсли;
	// Вывод итоговой надписи.
	Если ТекстОткрытия = "" Тогда
		ТекстОткрытия = "Все возможные награды разблокированы ранее.";
	КонецЕсли;
	Элементы.ДекорацияОткрытия.Заголовок = ТекстОткрытия;
КонецПроцедуры

&НаКлиенте
Процедура ИгратьСнова(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
