
// Вовзращает массив уменьшаемых парамтеров игрока.
//
// Возвращаемое значение:
// Массив - Массив, содержащий значения для уменьшаемых параметров игрока.
//
Функция ПолучитьУменьшаемыеПараметрыИгроков() Экспорт
	РезультатФункции = Новый Массив;
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Бомба);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Проклятие);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Неуклюжесть);
	Возврат РезультатФункции;
КонецФункции
