
// Вовзращает массив уменьшаемых парамтеров игрока.
//
// Возвращаемое значение:
// Массив - Массив, содержащий значения для уменьшаемых параметров игрока.
//
Функция ПолучитьУменьшаемыеПараметрыИгроков() Экспорт
	РезультатФункции = Новый Массив;
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Бомба);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Проклятие);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Неуклюжесть);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Горение);
	Возврат РезультатФункции;
КонецФункции

// Возвращает массив положительных параметров игрока.
//
// Возвращаемое значение:
// Массив - Массив, содержащий значения для положительных параметров игрока.
//
Функция ПолучитьПоложительныеПараметры() Экспорт
	РезультатФункции = Новый Массив;
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Сила);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Щит);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Ярость);
	Возврат РезультатФункции;
КонецФункции

// Возвращает массив отрицательных параметров игрока.
//
// Возвращаемое значение:
// Массив - Массив, содержащий значения для отрицательных параметров игрока.
//
Функция ПолучитьОтрицательныеПараметры() Экспорт
	РезультатФункции = Новый Массив;
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Бомба);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Неуклюжесть);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Проклятие);
	Возврат РезультатФункции;
КонецФункции

// Возвращает массив основных параметров игрока.
//
// Возвращаемое значение:
// Массив - Массив, содержащий значения для основных параметров игрока.
//
Функция ПолучитьОсновныеПараметры() Экспорт
	РезультатФункции = Новый Массив;
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Золото);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.МаксимальноеЗдоровье);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.ТекущееЗдоровье);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Энергия);
	Возврат РезультатФункции;
КонецФункции
