
// Отображает форму сообщения с заголовком ЗаголовокОкнаВход и
// основным текстом ТекстСообщенияВход, привязанную к форме
// ВладелецВход.
Процедура ПоказатьОкноСообщения(ТекстСообщенияВход, ЗаголовокОкнаВход, ВладелецВход) Экспорт
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗаголовокОкна", ЗаголовокОкнаВход);
	СтруктураПараметров.Вставить("ТекстСообщения", ТекстСообщенияВход);
	ОткрытьФорму("ОбщаяФорма.ФормаСообщение", СтруктураПараметров, ВладелецВход, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры		// ПоказатьОкноСообщения()