&НаСервере
Функция ПоместитьКартинкуСервер(КартинкаВход)
	Адрес = "";
	Адрес = ПоместитьВоВременноеХранилище(КартинкаВход, ЭтотОбъект);
	Возврат Адрес;
КонецФункции

&НаКлиенте
Процедура ИзменитьКартинку(Команда)
	Попытка
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Фильтр = "PNG (*.png)|*.png|JPEG (*.jpg)|*.jpg|Все файлы (*.*)|*.*";
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.Заголовок = "Выберите фотографию";
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
			Для Каждого ТекМассивФайлов Из МассивФайлов Цикл
				ТекКартинка = Новый Картинка(ТекМассивФайлов);
				СтрокаКартинка = ПоместитьКартинкуСервер(ТекКартинка);
			КонецЦикла;
		Иначе
			Сообщить("Файл не выбран. Фотография не изменена.");
		КонецЕсли;       
	Исключение
		Сообщить("Произошла ошибка при открытии фотографии: " + ОписаниеОшибки());
	КонецПопытки
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(СтрокаКартинка) Тогда
		Если ЭтоАдресВременногоХранилища(СтрокаКартинка) Тогда
			ЗначениеКартинки = ПолучитьИзВременногоХранилища(СтрокаКартинка);
			ТекущийОбъект.КартинкаЗадания = Новый ХранилищеЗначения(ЗначениеКартинки);
		Иначе
			//Не адрес. Нельзя записывать.
		КонецЕсли;
	Иначе
		//Нет ссылки
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтрокаКартинка = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "КартинкаЗадания");
КонецПроцедуры
