
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьЗдоровье(Команда)
	Закрыть(ВосстановленноеЗдоровье);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВосстановленноеЗдоровье = Параметры.ВосстановленноеЗдоровье;
	ТекущееЗдоровье = Параметры.ТекущееЗдоровье;
	КартыИгрока.Очистить();
	Для Каждого ТекКарта Из Параметры.КартыИгрока Цикл
		КартыИгрока.Добавить(ТекКарта.Значение);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКарту(Команда)
	Если КартыИгрока.Количество() <= 5 Тогда
		Сообщить("Нельзя удалить карту: у вас должно быть больше 5 карт.");
		Возврат;
	КонецЕсли;
	СписокКарт = Новый СписокЗначений;
	Для Каждого ТекКарта Из КартыИгрока Цикл
		СписокКарт.Добавить(ТекКарта.Значение);
	КонецЦикла;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораКартыДляУдаления", ЭтаФорма);
	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокКарт);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКартыДляУдаления(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		// Пользователь отменил выбор.
		Возврат;
	КонецЕсли;
	ЗначениеКарты = Результат.Значение;
	Если ТипЗнч(ЗначениеКарты) = Тип("СправочникСсылка.Карты") Тогда
		Закрыть(ЗначениеКарты);
	КонецЕсли;
КонецПроцедуры
