
// Проверяет, достигнуто ли пользователем достижение Сто вопросов отвечено.
Функция ЕстьДостижениеСтоОтветов(КоличествоЗаданныхВход) Экспорт
	РезультатФункции = (КоличествоЗаданныхВход >= 100);
	Возврат РезультатФункции;
КонецФункции		// ДостижениеСтоОтветов()

// Проверяет, достигнуто ли пользователем достижение Установлено 
// пятнадцать сборников.
Функция ЕстьДостижениеУстановленоПятнадцатьСборников() Экспорт
	РезультатФункции = Ложь;
	КоличествоСборников = ОбщегоНазначенияВызовСервера.ОпределитьКоличествоУстановленныхСборников();
	РезультатФункции = (КоличествоСборников >= 15);
	Возврат РезультатФункции;
КонецФункции		 // ЕстьДостижениеУстановленоПятнадцатьСборников()

// Проверяет, достигнуто ли достижение ДвадцатьВопросовЗаШестьдесятСекунд.
Функция ЕстьДостижениеДвадцатьВопросовЗаШестьдесятСекунд(МассивВход) Экспорт
	РезультатФункции = Ложь;
	Если МассивВход.Количество() = 20 Тогда
		ТекДата = ТекущаяДата();
		МинДата = Дата(2200, 1, 1);
		Для Каждого ТекМассивВход Из МассивВход Цикл
			Если ТекМассивВход < МинДата Тогда
				МинДата = ТекМассивВход;
			Иначе
				// Выполняем поиск далее.
			КонецЕсли;
		КонецЦикла;	
		РезультатФункции = ((ТекДата - МинДата) < 60);
	Иначе
		РезультатФункции = Ложь;
	КонецЕсли;
	Возврат РезультатФункции;	
КонецФункции		 // ЕстьДостижениеДвадцатьВопросовЗаШестьдесятСекунд()