
&НаКлиенте
Процедура Применить(Команда)
	СтруктураЗакрытия = Новый Структура;
	СтруктураЗакрытия.Вставить("Пользователь", Пользователь);
	СтруктураЗакрытия.Вставить("Сборник", Сборник);
	СтруктураЗакрытия.Вставить("РежимВикторины", РежимВикторины);
	Закрыть(СтруктураЗакрытия);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Пользователь	 = Параметры.Пользователь;
	Сборник			 = Параметры.Сборник;
	РежимВикторины	 = Параметры.РежимВикторины;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСправку(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РазделСправки", "НастройкиВикторины");
	ОткрытьФорму("Обработка.ОтображениеСправки.Форма.Форма", СтруктураПараметров);
КонецПроцедуры
