// Серверная обёртка команды выгрузить сборник.
&НаСервереБезКонтекста
Процедура ВыгрузитьСборник_Сервер(СборникВход, ИмяФайлаВход)
	Обработки.ПереносСборников.ВыгрузитьСборникВФайл(СборникВход, ИмяФайлаВход);	
КонецПроцедуры		// ВыгрузитьСборник_Сервер()

&НаСервереБезКонтекста
Процедура ЗагрузитьСборник_Сервер(ПутьКФайлуВход, ИзCsvВход = Ложь, НовоеИмяСборникаВход = "")
	Если ИзCsvВход Тогда
		СтрокаЗагрузки = "";
		СтрокаЗагрузки = СтрокаЗагрузки + "<?xml version=""1.0"" encoding=""UTF-8""?><Сборник><Наименование>";
		СтрокаЗагрузки = СтрокаЗагрузки + НовоеИмяСборникаВход;
		СтрокаЗагрузки = СтрокаЗагрузки + "</Наименование><Описание>";
		СтрокаЗагрузки = СтрокаЗагрузки + НовоеИмяСборникаВход;
		СтрокаЗагрузки = СтрокаЗагрузки + "</Описание><Автор>";
		СтрокаЗагрузки = СтрокаЗагрузки + ПараметрыСеанса.ТекущийПользователь.ИнформацияОбАвторе;
		СтрокаЗагрузки = СтрокаЗагрузки + "</Автор><Версия>1.0</Версия><Сложность>ШестьОтветов</Сложность><ИдентификаторСборника>";
		СтрокаЗагрузки = СтрокаЗагрузки + Строка(Новый УникальныйИдентификатор);
		СтрокаЗагрузки = СтрокаЗагрузки + "</ИдентификаторСборника><Вопросы>";
		мСтрокФайла = Новый Массив();
		Файл = Новый ЧтениеТекста(ПутьКФайлуВход);
		Строка = "";
		Пока Строка <> Неопределено Цикл
			Строка = Файл.ПрочитатьСтроку();
			Если Строка <> Неопределено Тогда
				МассивПодстрок = ОбщегоНазначенияКлиентСервер.РазложитьСтрокуНаПодстроки(Строка, ";");
				Если МассивПодстрок.Количество() > 2 Тогда
					ТекстНаименование = МассивПодстрок[0];
					ТекстВопрос = МассивПодстрок[1];
					ТекстОтвет = МассивПодстрок[2];
					СтрокаЗагрузки = СтрокаЗагрузки + "<Вопрос><Наименование>";
					СтрокаЗагрузки = СтрокаЗагрузки + ТекстНаименование;
					СтрокаЗагрузки = СтрокаЗагрузки + "</Наименование><ТекстВопроса>";
					СтрокаЗагрузки = СтрокаЗагрузки + ТекстВопрос;
					СтрокаЗагрузки = СтрокаЗагрузки + "</ТекстВопроса><КартинкаЗадания></КартинкаЗадания><Ответы><Ответ><ТекстОтвета>";
					СтрокаЗагрузки = СтрокаЗагрузки + ТекстОтвет;
					СтрокаЗагрузки = СтрокаЗагрузки + "</ТекстОтвета><Правильность>true</Правильность></Ответ></Ответы></Вопрос>"
				Иначе
					// Пропускаем строку.
				КонецЕсли;
			Иначе
				// Достигнут конец файла.
			КонецЕсли;
		КонецЦикла;
		Файл.Закрыть();
		СтрокаЗагрузки = СтрокаЗагрузки + "</Вопросы></Сборник>";
		Обработки.ПереносСборников.ЗагрузитьСборник_Сервер(, СтрокаЗагрузки);
	Иначе	
		Обработки.ПереносСборников.ЗагрузитьСборник_Сервер(ПутьКФайлуВход);
	КонецЕсли;
КонецПроцедуры

// Управляет доступностью элементов на форме.
&НаСервере
Процедура УправлениеДоступностью()
	Элементы.НовоеИмяСборника.Видимость = ИзCSV;
КонецПроцедуры		// УправлениеДоступностью()

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
	    Если ВыбранноеЗначение.Количество() > 0 Тогда
	        ПервыйЭлемент = ВыбранноеЗначение[0];
	        ИмяФайлаВыгрузка = ПервыйЭлемент;
	    Иначе
	        Сообщить(НСтр("ru = 'Не удалось выбрать файл'"));
	    КонецЕсли;
	Иначе
	    Сообщить(НСтр("ru = 'Не удалось выбрать файл'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	#Если НЕ МобильноеПриложениеКлиент Тогда
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогВыбораФайла.Фильтр = "XML (*.xml)|*.xml|Все файлы (*.*)|*.*";
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма);
		ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	#Иначе
		
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьСборник(Команда)
	ВыгрузитьСборник_Сервер(Сборник, ИмяФайлаВыгрузка);
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаЗагрузкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Попытка
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Фильтр = "xml (*.xml)|*.xml|Текст с разделителями в csv (*.csv)|*.csv|Все файлы (*.*)|*.*";
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.Заголовок = "Выберите сохранённый сборник";
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
			Для Каждого ТекМассивФайлов Из МассивФайлов Цикл
				ИмяФайлаЗагрузка = ТекМассивФайлов;
			КонецЦикла;
		Иначе
			Сообщить("Файл не выбран. Загрузка отменена.");
		КонецЕсли;       
	Исключение
		Сообщить("Произошла ошибка при открытии сборника: " + ОписаниеОшибки());
	КонецПопытки
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСборник(Команда)
	Если СокрЛП(ИмяФайлаЗагрузка) <> "" Тогда
		ЗагрузитьСборник_Сервер(ИмяФайлаЗагрузка, ИзCSV, НовоеИмяСборника);
	Иначе
		Сообщить("Файл не выбран");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзCSVПриИзменении(Элемент)
	УправлениеДоступностью();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеДоступностью();
КонецПроцедуры
